In [3]:
import pandas as pd

In [5]:
ls

01_intro.ipynb   data.ipynb       key.ipynb        transaction.csv
Untitled.ipynb   db.sqlite3       pandas.ipynb
customer.csv     example/         pandas.zip
customer.xlsx    item.csv         record.csv

In [7]:
df = pd.read_csv('transaction.csv')

In [12]:
df

        id  customer_id             datetime
0        1            1  2019-03-10 03:15:17
1        2            2  2019-03-10 03:16:14
2        3            1  2019-03-10 03:17:24
3        4           62  2016-10-30 10:08:41
4        5           95  2016-10-30 10:13:03
...    ...          ...                  ...
9526  9680           33  2017-04-09 14:24:03
9527  9681           79  2017-04-09 14:30:09
9528  9682           13  2017-04-09 14:32:58
9529  9683           89  2017-04-09 14:57:06
9530  9684            4  2017-04-09 15:04:24

[9531 rows x 3 columns]

In [18]:
df.head(7)

   id  customer_id             datetime
0   1            1  2019-03-10 03:15:17
1   2            2  2019-03-10 03:16:14
2   3            1  2019-03-10 03:17:24
3   4           62  2016-10-30 10:08:41
4   5           95  2016-10-30 10:13:03
5   6           65  2016-10-30 10:16:55
6   7           35  2016-10-30 10:19:12